УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/смартКорректировкаКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартКорректировкаКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 04.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоэффициента</name>
    <type>
      <types>EnumRef.смартВидыКоэффициентовМенеджеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтВыручки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКонверсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтПотериЛидов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтКоммерческогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОтМаркетинговогоОтдела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартВидыКоэффициентовМенеджеров/смартВидыКоэффициентовМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыКоэффициентовМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 07.12.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <enumValues>
    <name>ИтоговыйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКонверсии</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтПотериЛидов</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтКоммерческогоОтдела</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентОтМаркетинговогоОтдела</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартКорректировкаКоэффициентовМенеджеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаСмартКоэффициентыМенеджеров(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);

	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаСмартКоэффициентыМенеджеров(Запрос, ТекстыЗапроса, Регистры) Экспорт

	ИмяРегистра = "смартКоэффициентыМенеджеров";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата КАК Период,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер КАК Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент) КАК ВидКоэффициента,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.ИтоговыйКоэффициент КАК Коэффициент
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтВыручки),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтВыручки
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКонверсии),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтКонверсии
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтПотериЛидов),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтПотериЛидов
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента = ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтКоммерческогоОтдела
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента В (ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент), ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтКоммерческогоОтдела))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.Дата,
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Менеджер,
	               |	ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела),
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.КоэффициентОтМаркетинговогоОтдела
	               |ИЗ
	               |	Документ.смартКорректировкаКоэффициентовМенеджеров.Менеджеры КАК смартКорректировкаКоэффициентовМенеджеровМенеджеры
	               |ГДЕ
	               |	смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка = &Ссылка
	               |	И смартКорректировкаКоэффициентовМенеджеровМенеджеры.Ссылка.ВидКоэффициента В (ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.ИтоговыйКоэффициент), ЗНАЧЕНИЕ(Перечисление.смартВидыКоэффициентовМенеджеров.КоэффициентОтМаркетинговогоОтдела))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
